In [1]:
import pandas as pd
from io import StringIO
import sys

csv_data = \
'''A,B,C,D
1.0,2.0,3.0,4.0
5.0,6.0,,8.0
10.0,11.0,12.0,'''

df = pd.read_csv(StringIO(csv_data))
df

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

In [2]:
# isnull() method
df.isnull()

       A      B      C      D
0  False  False  False  False
1  False  False   True  False
2  False  False  False   True

In [4]:
#de lehet rogton kombinalni is
df.isnull().sum()

A    0
B    0
C    1
D    1
dtype: int64

In [5]:
#lehet dataframeket is hasznalni, mint scikit bemenetet, de jobb numpy arrayt hasznalni
#mindig at lehet tenni a values atributummal 
df.values

array([[ 1.,  2.,  3.,  4.],
       [ 5.,  6., nan,  8.],
       [10., 11., 12., nan]])

In [6]:
#Eliminating training examples or features with missing values
df.dropna(axis=0) #remove rows with NaN

     A    B    C    D
0  1.0  2.0  3.0  4.0

In [7]:
df.dropna(axis=1) #remove columns with NaN

      A     B
0   1.0   2.0
1   5.0   6.0
2  10.0  11.0

In [8]:
# only drop rows where all columns are NaN
df.dropna(how='all')

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

In [9]:
# drop rows that have fewer than 3 real values 
df.dropna(thresh=4)

     A    B    C    D
0  1.0  2.0  3.0  4.0

In [10]:
# only drop rows where NaN appear in specific columns (here: 'C')
df.dropna(subset=['C'])

      A     B     C    D
0   1.0   2.0   3.0  4.0
2  10.0  11.0  12.0  NaN